{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "31347698",
   "metadata": {},
   "outputs": [],
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых\n",
    "данных исполнять пользовательские команды.\n",
    "Исходные данные имеют следующую структуру:\n",
    "1. перечень всех документов\n",
    "\n",
    "documents = [\n",
    "{‘type’: ‘passport’, ‘number’: ‘2207 876234’, ‘name’: ‘Василий Гупкин’},\n",
    "{‘type’: ‘invoice’, ‘number’: ‘11-2’, ‘name’: ‘Геннадий Покемонов’},\n",
    "{‘type’: ‘insurance’, ‘number’: ‘10006’, ‘name’: ‘Аристарх Павлов’}\n",
    "]\n",
    "\n",
    "2. перечень полок, на которых хранятся документы (если документ есть в documents, он обязательно должен быть и в directories)\n",
    "\n",
    "directories = {\n",
    "‘1’: [‘2207 876234’, ‘11-2’],\n",
    "‘2’: [‘10006’],\n",
    "‘3’: []\n",
    "}\n",
    "\n",
    "Общие требования к программе:\n",
    "код должен быть грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции\n",
    "переиспользуются, а их код не повторяется;\n",
    "в коде отсутствуют глобальные переменные, за исключением documents и directories;\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу вводом команды q.\n",
    "\n",
    "Задача 1\n",
    "Пользователь по команде p может узнать владельца документа по его номеру.\n",
    "Пример работы программы:\n",
    "\n",
    "Введите команду:\n",
    "p\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3d8b259d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду (p - поиск владельца, q - выход):\n",
      "p\n",
      "Введите номер документа:\n",
      "10006\n",
      "Результат:\n",
      "Владелец документа: Аристарх Павлов\n",
      "Введите команду (p - поиск владельца, q - выход):\n",
      "p\n",
      "Введите номер документа:\n",
      "11-2\n",
      "Результат:\n",
      "Владелец документа: Геннадий Покемонов\n",
      "Введите команду (p - поиск владельца, q - выход):\n",
      "123\n",
      "Некорректная команда. Пожалуйста, введите 'p' или 'q'.\n",
      "Введите команду (p - поиск владельца, q - выход):\n",
      "p\n",
      "Введите номер документа:\n",
      "11\n",
      "Документ не найден\n",
      "Введите команду (p - поиск владельца, q - выход):\n",
      "q\n",
      "Программа завершена.\n"
     ]
    }
   ],
   "source": [
    "def find_owner_by_document_number(documents, doc_number):\n",
    "    for doc in documents:\n",
    "        if doc['number'] == doc_number:\n",
    "            return doc['name']\n",
    "    return None\n",
    "\n",
    "def process_command_p(documents):\n",
    "    doc_number = input(\"Введите номер документа:\\n\")\n",
    "    owner = find_owner_by_document_number(documents, doc_number)\n",
    "    if owner:\n",
    "        print(f\"Результат:\\nВладелец документа: {owner}\")\n",
    "    else:\n",
    "        print(\"Документ не найден\")\n",
    "\n",
    "def process_command_q():\n",
    "    print(\"Программа завершена.\")\n",
    "    quit()\n",
    "\n",
    "def main():\n",
    "    documents = [\n",
    "        {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "        {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "        {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "    ]\n",
    "\n",
    "    directories = {\n",
    "        '1': ['2207 876234', '11-2'],\n",
    "        '2': ['10006'],\n",
    "        '3': []\n",
    "    }\n",
    "\n",
    "    while True:\n",
    "        command = input(\"Введите команду (p - поиск владельца, q - выход):\\n\")\n",
    "        \n",
    "        if command == 'p':\n",
    "            process_command_p(documents)\n",
    "        elif command == 'q':\n",
    "            process_command_q()\n",
    "        else:\n",
    "            print(\"Некорректная команда. Пожалуйста, введите 'p' или 'q'.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "239ec55c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
