{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5099e4e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "Задание: написать программу, которая поможет пользователям определить, сколько денег они могут сэкономить на покупках\n",
    "в разных магазинах.\n",
    "\n",
    "Условия:\n",
    "1) Пользователь должен ввести список товаров, которые он собирается купить, и цены на эти товары в разных магазинах.\n",
    "2) Затем программа должна вывести список магазинов и общую стоимость покупок в каждом магазине, а также сообщить, в каком \n",
    "магазине пользователь может сэкономить больше всего денег.\n",
    "3) Cписок товаров и магазинов определяется самостоятельно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "2b56556b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Товары в наличии:\n",
      "Смартфон 'Технофон X'\n",
      "Ноутбук 'Элитбук Pro'\n",
      "Телевизор 'Мегавид 4K'\n",
      "Кофемашина 'Ароматно'\n",
      "Холодильник 'Фрешмейкер'\n",
      "\n",
      "Сколько Смартфон 'Технофон X' вы хотите приобрести: 1\n",
      "Сколько Ноутбук 'Элитбук Pro' вы хотите приобрести: 0\n",
      "Сколько Телевизор 'Мегавид 4K' вы хотите приобрести: 0\n",
      "Сколько Кофемашина 'Ароматно' вы хотите приобрести: 0\n",
      "Сколько Холодильник 'Фрешмейкер' вы хотите приобрести: 0\n",
      "\n",
      "Информация о товарах и ценах в каждом магазине:\n",
      "\n",
      "Электроника Маркет:\n",
      "Смартфон 'Технофон X': 158 рублей\n",
      "Ноутбук 'Элитбук Pro': 206 рублей\n",
      "Телевизор 'Мегавид 4K': 242 рублей\n",
      "Кофемашина 'Ароматно': 72 рублей\n",
      "Холодильник 'Фрешмейкер': 227 рублей\n",
      "Общая стоимость: 158 рублей\n",
      "\n",
      "ТехноТрейд:\n",
      "Смартфон 'Технофон X': 81 рублей\n",
      "Ноутбук 'Элитбук Pro': 293 рублей\n",
      "Телевизор 'Мегавид 4K': 257 рублей\n",
      "Кофемашина 'Ароматно': 79 рублей\n",
      "Холодильник 'Фрешмейкер': 104 рублей\n",
      "Общая стоимость: 81 рублей\n",
      "\n",
      "Домашние Бытовые Товары:\n",
      "Смартфон 'Технофон X': 70 рублей\n",
      "Ноутбук 'Элитбук Pro': 288 рублей\n",
      "Телевизор 'Мегавид 4K': 171 рублей\n",
      "Кофемашина 'Ароматно': 240 рублей\n",
      "Холодильник 'Фрешмейкер': 178 рублей\n",
      "Общая стоимость: 70 рублей\n",
      "\n",
      "Вы можете сэкономить больше всего денег, выбрав магазин 'Домашние Бытовые Товары'.\n"
     ]
    }
   ],
   "source": [
    "import random\n",
    "\n",
    "# Создаем список товаров с их названиями\n",
    "products = [\n",
    "    \"Смартфон 'Технофон X'\",\n",
    "    \"Ноутбук 'Элитбук Pro'\",\n",
    "    \"Телевизор 'Мегавид 4K'\",\n",
    "    \"Кофемашина 'Ароматно'\",\n",
    "    \"Холодильник 'Фрешмейкер'\"\n",
    "]\n",
    "\n",
    "# Вывод списка товаров\n",
    "print(\"Товары в наличии:\")\n",
    "for product in products:\n",
    "    print(product)\n",
    "print()\n",
    "\n",
    "# Запрос товаров и их количества у пользователя\n",
    "user_shopping = {}\n",
    "for product in products:\n",
    "    quantity = int(input(f\"Сколько {product} вы хотите приобрести: \"))\n",
    "    user_shopping[product] = quantity\n",
    "\n",
    "# Создаем словарь для каждого магазина с разной стоимостью товаров\n",
    "store1 = {product: random.randint(50, 300) for product in products}\n",
    "store2 = {product: random.randint(50, 300) for product in products}\n",
    "store3 = {product: random.randint(50, 300) for product in products}\n",
    "\n",
    "# Создаем словарь, где ключами являются названия магазинов, а значениями - структуры данных для товаров\n",
    "stores = {\n",
    "    \"Электроника Маркет\": store1,\n",
    "    \"ТехноТрейд\": store2,\n",
    "    \"Домашние Бытовые Товары\": store3\n",
    "}\n",
    "\n",
    "# Создаем словарь для записи вывода\n",
    "output_data = {}\n",
    "\n",
    "# Записываем информацию о товарах и ценах в словарь\n",
    "for store, products in stores.items():\n",
    "    store_data = {}\n",
    "    total_cost = 0\n",
    "    for product, price in products.items():\n",
    "        if product in user_shopping:\n",
    "            total_cost += user_shopping[product] * price\n",
    "        store_data[product] = price\n",
    "    output_data[store] = {\n",
    "        \"Products\": store_data,\n",
    "        \"Total Cost\": total_cost\n",
    "    }\n",
    "\n",
    "# Выводим информацию о товарах и ценах в каждом магазине и общую стоимость покупок\n",
    "print()\n",
    "print(\"Информация о товарах и ценах в каждом магазине:\")\n",
    "print()\n",
    "for store, data in output_data.items():\n",
    "    print(f\"{store}:\")\n",
    "    for product, price in data[\"Products\"].items():\n",
    "        print(f\"{product}: {price} рублей\")\n",
    "    print(f\"Общая стоимость: {data['Total Cost']} рублей\")\n",
    "    print()\n",
    "\n",
    "# Определяем, в каком магазине пользователь может сэкономить больше всего денег\n",
    "max_savings = min(output_data, key=lambda store: output_data[store][\"Total Cost\"])\n",
    "print(f\"Вы можете сэкономить больше всего денег, выбрав магазин '{max_savings}'.\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
